
CanNotAddMirror = \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u30B3\u30DF\u30C3\u30C8\u4E2D\u306B\u65B0\u3057\u3044\u30DF\u30E9\u30FC\u3092\u8FFD\u52A0\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002

CanNotDeleteNonAggregateRoot = \u975E\u96C6\u7D04\u30EB\u30FC\u30C8\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002

CloseServiceHost = \u30B5\u30FC\u30D3\u30B9\u30DB\u30B9\u30C8\u3092\u9589\u3058\u308B\u306B\u306F\u3001\u4EFB\u610F\u306E\u30AD\u30FC\u3092\u62BC\u3057\u3066\u304F\u3060\u3055\u3044\u3002

ClosedServiceHost = \u30B5\u30FC\u30D3\u30B9\u30DB\u30B9\u30C8\u304C\u7D42\u4E86\u3057\u307E\u3057\u305F\u3002

CloseingServiceHost = \u30B5\u30FC\u30D3\u30B9\u30DB\u30B9\u30C8\u3092\u7D42\u4E86\u3057\u3066\u3044\u307E\u3059\u3002

ConstructedError = \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u69CB\u7BC9\u6642\u306B\u672A\u77E5\u306E\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002\u69CB\u7BC9\u968E\u5C64\u304C\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u5B9F\u969B\u306E\u30BF\u30A4\u30D7\u968E\u5C64\u3092\u8D85\u3048\u3066\u3044\u307E\u3059\u3002

ConstructionParameterError = \u30BF\u30A4\u30D7 %s \u306E\u30EA\u30DD\u30B8\u30C8\u30EA\u69CB\u9020\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC %s \u306E\u30C7\u30FC\u30BF\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\u30AB\u30B9\u30BF\u30E0\u306E\u30ED\u30FC\u30C9\u65B9\u6CD5\u304C\u5FC5\u8981\u304B\u3069\u3046\u304B\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002

ConstructionParameterNoProperty = \u69CB\u9020\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC {0} \u306B\u5BFE\u5FDC\u3059\u308B\u5C5E\u6027 {1} \u306E\u5B9A\u7FA9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\u5C5E\u6027\u304C PropertyRepositoryAttribute \u3067\u30DE\u30FC\u30AF\u3055\u308C\u3066\u3044\u308B\u304B\u3001\u307E\u305F\u306F\u30AB\u30B9\u30BF\u30E0\u306E\u69CB\u9020\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u30ED\u30FC\u30C7\u30A3\u30F3\u30B0\u30E1\u30BD\u30C3\u30C9\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u304B\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002

DataContextNull = DataContext.Current\u304Cnull\u3067\u3059\u3002\u30EA\u30DD\u30B8\u30C8\u30EA\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002

DataVersionError = \u30D0\u30FC\u30B8\u30E7\u30F3\u756A\u53F7\u304C\u8AA4\u3063\u3066\u3044\u307E\u3059\u3002\u30BF\u30A4\u30D7 %s\u3001\u756A\u53F7 %s \u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u72B6\u614B\u306E\u5909\u66F4\u307E\u305F\u306F\u524A\u9664\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002

DidNotFindEmptyType = %s \u306E Emptyable \u30BF\u30A4\u30D7\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002

DidNotFindValueType = %s \u306EValueType\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002

DomainCanNotNull = \u30C9\u30E1\u30A4\u30F3\u8A2D\u8A08\u306B\u304A\u3044\u3066\u3001\u3059\u3079\u3066\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306Fnull\u3067\u3042\u3063\u3066\u306F\u306A\u308A\u307E\u305B\u3093\u3002\u30A8\u30E9\u30FC\u306E\u539F\u56E0\uFF1A%s\u3002

DomainObjectLoadError = DTO\u30C7\u30FC\u30BF\u5F62\u5F0F\u304C\u8AA4\u3063\u3066\u304A\u308A\u3001\u5B9A\u7FA9 %s \u3068\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002

DomainObjectTypeWrong = \u30C9\u30E1\u30A4\u30F3\u8A2D\u8A08\u306B\u304A\u3044\u3066\u3001\u57FA\u672C\u6570\u5024\u578B\u3084Emptyable\u69CB\u9020\u3092\u9664\u304D\u3001\u3059\u3079\u3066\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u5024\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3001\u96C6\u7D04\u30EB\u30FC\u30C8\u3001\u53C2\u7167\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\uFF08\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\uFF09\u3001\u30EA\u30E2\u30FC\u30C8\u96C6\u7D04\u30EB\u30FC\u30C8\u304B\u3089\u7D99\u627F\u3059\u3079\u304D\u3067\u3059\u3002

DomainSameName = \u30C9\u30E1\u30A4\u30F3\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 %s \u3068 %s \u304C\u540C\u3058\u540D\u524D\u3067\u3059\u3002

EmptyObjectNotRepository = \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304Cnull\u3067\u3001\u6C38\u7D9A\u5316\u64CD\u4F5C\u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3002\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30BF\u30A4\u30D7 %s\u3002

EmptyReadOnly = \u7A7A\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 %s \u306F\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u3067\u3059\u3002

FailedParseLock = \u30ED\u30C3\u30AF\u30EC\u30D9\u30EB\u306E\u89E3\u6790\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002

GetUniqueKeyError = \u578B %s \u306E\u30E6\u30CB\u30FC\u30AF\u30AD\u30FC\u3092\u8A08\u7B97\u3067\u304D\u307E\u305B\u3093\u3002IAggregateRoot\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002

IncorrectEmailFormat = \u5C5E\u6027 %s \u306F\u6B63\u3057\u3044\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u306E\u5F62\u5F0F\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002

LoadPropertyError = \u5C5E\u6027 %s \u306E\u30C7\u30FC\u30BF\u304C\u6B63\u5E38\u306B\u30ED\u30FC\u30C9\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u30AB\u30B9\u30BF\u30E0\u306E\u30ED\u30FC\u30C9\u65B9\u6CD5\u304C\u5FC5\u8981\u304B\u3069\u3046\u304B\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002

MetadataNotInitialized = \u30E1\u30BF\u30C7\u30FC\u30BF\u306F\u307E\u3060\u521D\u671F\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002

NeedTypeKey = \u30C9\u30E1\u30A4\u30F3\u6D3E\u751F\u30AF\u30E9\u30B9 %s \u306F\u4E00\u610F\u306EtypeKey\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002

NestedCollection = \u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u30E1\u30F3\u30D0\u30FC\u3082\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u578B\u3067\u3042\u308A\u3001\u30C9\u30E1\u30A4\u30F3\u8A2D\u8A08\u3067\u3053\u306E\u3088\u3046\u306A\u8907\u96D1\u306A\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u95A2\u4FC2\u3092\u5B9A\u7FA9\u3059\u308B\u3053\u3068\u306F\u304A\u52E7\u3081\u3057\u307E\u305B\u3093\u3002

NoDefineMethodFromRepository = \u30EA\u30DD\u30B8\u30C8\u30EA %s \u306B\u30E1\u30BD\u30C3\u30C9 %s \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002

NoDomainClass = \u5024\u306B\u5BFE\u5FDC\u3059\u308B\u30C9\u30E1\u30A4\u30F3\u30BF\u30A4\u30D7\u304C\u3042\u308A\u307E\u305B\u3093\uFF1A%s\u3002

NoEnum = \u5024\u306B\u5BFE\u5FDC\u3059\u308B\u5217\u6319\u5B9A\u6570\u304C\u3042\u308A\u307E\u305B\u3093\uFF1A%s\u3002

NoFoundDomainEvent = \u30C9\u30E1\u30A4\u30F3\u30A4\u30D9\u30F3\u30C8 %s \u306E\u5B9A\u7FA9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002

NoMaster = %s \u306E\u4F1D\u9001\u5B9A\u7FA9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002

NoRepositoryConstructor = \u30BF\u30A4\u30D7 %s \u306B\u306F\u30EA\u30DD\u30B8\u30C8\u30EA\u30B3\u30F3\u30B9\u30C8\u30E9\u30AF\u30BF\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002

NotASCII = %s \u306FASCII\u6587\u5B57\u5217\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002

NotDefinedObjectRepository = Type {0} \u306F ObjectRepository \u3092\u5B9A\u7FA9\u3057\u3066\u3044\u307E\u305B\u3093\u3002

NotDynamicRootType = %s \u306F\u30C0\u30A4\u30CA\u30DF\u30C3\u30AF\u30EB\u30FC\u30C8\u30BF\u30A4\u30D7\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002

NotEmpty = \u30D7\u30ED\u30D1\u30C6\u30A3 %s \u306F\u7A7A\u306B\u3067\u304D\u307E\u305B\u3093\u3002

NotExistLockManager = ILockManager\u306E\u5B9F\u88C5\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u305F\u3081\u3001\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u30ED\u30C3\u30AF\u3067\u304D\u307E\u305B\u3093\u3002

NotFoundDerivedType = %s \u306E\u30C9\u30E1\u30A4\u30F3\u6D3E\u751F\u30AF\u30E9\u30B9\u30BF\u30A4\u30D7\u306B\u5BFE\u5FDC\u3059\u308B\u30C7\u30FC\u30BF\u30C6\u30FC\u30D6\u30EB\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002

NotFoundDomainObject = %s \u306E\u5B9A\u7FA9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002

NotFoundDomainProperty = \u578B %s \u53CA\u3073\u305D\u306E\u7D99\u627F\u30C1\u30A7\u30FC\u30F3\u4E0A\u306B\u30C9\u30E1\u30A4\u30F3\u5C5E\u6027 %s \u306E\u5B9A\u7FA9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002

NotFoundEmpty = \u578B %s \u306B\u306FEmpty\u9759\u6001\u5C5E\u6027\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u304B\u3001Empty\u9759\u6001\u5C5E\u6027\u306B\u5024\u304C\u5272\u308A\u5F53\u3066\u3089\u308C\u3066\u3044\u307E\u305B\u3093\u3002

NotFoundForStateEvent = \u72B6\u614B\u30A4\u30D9\u30F3\u30C8\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3067 %s \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002

NotFoundRemotable = \u30EA\u30E2\u30FC\u30C8\u6A5F\u80FD\u306E\u5B9A\u7FA9\u304C %s \u306B\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002

NotFoundRepository = \u5B9F\u88C5\u3055\u308C\u305F%s\u30EA\u30DD\u30B8\u30C8\u30EA\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002

NotFoundTableField = \u30C6\u30FC\u30D6\u30EB %s \u306B\u306F\u30D5\u30A3\u30FC\u30EB\u30C9 %s \u304C\u3042\u308A\u307E\u305B\u3093\u3002

NotOpenTransaction = \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002

NotSupportMultipleProperties = %s \u30A8\u30E9\u30FC\u3001\u8907\u6570\u306E\u5C5E\u6027\u306E\u30AF\u30A8\u30EA\u306F\u307E\u3060\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002

NotSupportRefNative = \u73FE\u5728\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u306F\u3001\u52D5\u7684\u30C9\u30E1\u30A4\u30F3\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u5185\u3067\u30CD\u30A4\u30C6\u30A3\u30D6\u30C9\u30E1\u30A4\u30F3\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u53C2\u7167\u3059\u308B\u3053\u3068\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002

NotSupportedDefaultValue = \u305D\u306E\u7A2E\u985E\u306E\u30C7\u30FC\u30BF\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u3092\u53D6\u5F97\u3059\u308B\u3053\u3068\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002

ObjectInvalid = \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u7121\u52B9\u3067\u3001%s \u64CD\u4F5C\u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3002

PersistentObjectError = \u30BF\u30A4\u30D7 %s \u304C\u8AA4\u3063\u3066\u3044\u307E\u3059\u3002\u76F4\u63A5\u6301\u7D9A\u5316\u3059\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30BF\u30A4\u30D7\u306F IAggregateRoot \u307E\u305F\u306F IEntityObjectPro \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002

QueryExpressionMalformed = \u30AF\u30A8\u30EA\u5F0F '%s' \u306E\u5F62\u5F0F\u304C\u6B63\u3057\u304F\u3042\u308A\u307E\u305B\u3093\u3002

RepeateRepository = \u30EA\u30DD\u30B8\u30C8\u30EA %s \u306F\u65E2\u306B\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u3059\u3002

RepeatedCommit = \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306F\u65E2\u306B\u30B3\u30DF\u30C3\u30C8\u6BB5\u968E\u306B\u5165\u3063\u3066\u3044\u307E\u3059\u3002\u91CD\u8907\u3057\u3066\u30B3\u30DF\u30C3\u30C8\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002

RepeatedDomainProperty = \u578B %s \u306F\u30D7\u30ED\u30D1\u30C6\u30A3 %s \u3092\u91CD\u8907\u5B9A\u7FA9\u3057\u3066\u3044\u307E\u3059\u3002

SQLFormatError = SQL\u306E\u5F62\u5F0F\u304C\u6B63\u3057\u304F\u306A\u3044\u305F\u3081\u3001\u91CD\u8981\u306A\u60C5\u5831\u306E\u62BD\u51FA\u306B\u5931\u6557\u3057\u307E\u3057\u305F %s\u3002

ServiceIsClose = \u30B5\u30FC\u30D3\u30B9 %s \u306F\u9589\u3058\u3089\u308C\u307E\u3057\u305F\u3002

ServiceIsOpen = \u30B5\u30FC\u30D3\u30B9 %s \u304C\u958B\u304B\u308C\u307E\u3057\u305F\u3002

SingleTableQBError = \u30C6\u30FC\u30D6\u30EB\u306E\u6570\u306F1\u3064\u306B\u9650\u308A\u307E\u3059\u3002

StartServiceHost = \u30B5\u30FC\u30D3\u30B9\u30DB\u30B9\u30C8\u3092\u8D77\u52D5\u3057\u3066\u3044\u307E\u3059\u3002

StartingService = \u30B5\u30FC\u30D3\u30B9\u3092\u8D77\u52D5\u4E2D\u3067\u3059\u3002\u3057\u3070\u3089\u304F\u304A\u5F85\u3061\u304F\u3060\u3055\u3044\u3002

StringLengthLessThan = %s \u306E\u9577\u3055\u304C %s \u3088\u308A\u77ED\u3044\u3067\u3059\u3002

StringLengthMoreThan = %s \u306E\u9577\u3055\u304C %s \u3088\u308A\u9577\u3044\u3067\u3059\u3002

TableNotId = \u8868 %s \u306B\u306F id \u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u306A\u304F\u3001\u305D\u308C\u3092\u4E3B\u30C6\u30FC\u30D6\u30EB\u3068\u3059\u308B\u5916\u90E8\u30AD\u30FC\u60C5\u5831\u3092\u53D6\u5F97\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002

TransactionStarted = \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u958B\u59CB\u3055\u308C\u307E\u3057\u305F\u3002

TypeDefineFindTypeError = \u672A\u77E5\u306E\u30BF\u30A4\u30D7 %s\u3002

TypeNotImple = \u578B %s \u306F %s \u3092\u5B9F\u88C5\u3057\u3066\u3044\u307E\u305B\u3093\u3002

UnableGetId = \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 %s \u306E\u756A\u53F7\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3002

UninitializedDomainObject = \u30C9\u30E1\u30A4\u30F3\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u521D\u671F\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002

UnknownException = \u672A\u77E5\u306E\u4F8B\u5916\u3002

UnrecognizedType = \u7121\u6CD5\u8B58\u5225\u52D5\u614B\u985E\u578B %s\u3002

UnsupportedDatabase = \u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3067\u3059\u3002

UnsupportedFieldType = \u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u30D5\u30A3\u30FC\u30EB\u30C9\u30BF\u30A4\u30D7 %s\u3002

ValueObjectReadOnly = ValueObject\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 %s \u306F\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u3067\u3059\u3002
