ArgCanNotNull=%s \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F null \u306B\u3067\u304D\u307E\u305B\u3093\u3002
ArgOutOfRange=\u30D1\u30E9\u30E1\u30FC\u30BF\u304C\u7BC4\u56F2\u5916\u3067\u3059\u3002
ArrayUseLoop=\u30EB\u30FC\u30D7\u30E1\u30BD\u30C3\u30C9\u3092\u4F7F\u3063\u3066\u914D\u5217\u3092\u53CD\u5FA9\u51E6\u7406\u3057\u3066\u304F\u3060\u3055\u3044\u3002
BorrowPoolItemFailed=\u30D7\u30FC\u30EB\u304B\u3089\u306E\u8CB8\u3057\u51FA\u3057\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u30D7\u30FC\u30EB\u306E\u30BF\u30A4\u30D7\u306Fs%\u3067\u3059\u3002
CannotConvert=%s \u3092 %s \u306B\u5909\u63DB\u3067\u304D\u307E\u305B\u3093\u3002
CannotEmpty=%s\u306F\u7A7A\u3067\u306F\u3044\u3051\u307E\u305B\u3093
CannotInvokeStatic=\u9759\u7684\u30E1\u30BD\u30C3\u30C9\u306B\u306F'this'\u3092\u8AAD\u307F\u8FBC\u3081\u307E\u305B\u3093\u3002
CannotReturnPoolItem=\u305D\u306E\u30A2\u30A4\u30C6\u30E0\u306F\u8CB8\u3057\u51FA\u3055\u308C\u3066\u304A\u3089\u305A\u3001\u30D7\u30FC\u30EB\u306B\u623B\u3059\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093 (%s)\u3002
DTOEntityNotFound=%s \u306B\u5BFE\u5FDC\u3059\u308BDTO\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
DTOExpressionError=\u5F0F\u30A8\u30E9\u30FC %s \u3002
DTOListTypeCountError=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3 %s \u306B\u306F\u3001\u30E1\u30F3\u30D0\u30FC\u5B9A\u7FA9\u306F1\u3064\u3057\u304B\u3042\u308A\u307E\u305B\u3093\u3002
DTOMemberNotMatch=\u5F0F %s \u306B\u5BFE\u5FDC\u3059\u308BDTO\u30E1\u30F3\u30D0\u30FC\u306F %s \u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
DTONotFoundCtor=\u73FE\u5728\u306EDTO\u30C7\u30FC\u30BF\u306B\u306F\u3001\u30BF\u30A4\u30D7 %s \u306B\u4E00\u81F4\u3059\u308B\u30B3\u30F3\u30B9\u30C8\u30E9\u30AF\u30BF\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
DTONotSpecifyType=\u30A8\u30F3\u30C8\u30EA\u30FC %s \u306B\u306F\u30BF\u30A4\u30D7\u60C5\u5831\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
DTOReadOnly=dto\u306F\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u3067\u3059
DataTypeNotSupported=ORM\u306B\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u30C7\u30FC\u30BF\u30BF\u30A4\u30D7 %s \u3002
DisposePoolItemFailed=\u30D7\u30FC\u30EB\u5185\u306E\u30A2\u30A4\u30C6\u30E0\u306E\u7834\u68C4\u3068\u89E3\u653E\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3001\u30A8\u30E9\u30FC\u306Fs%\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u767A\u751F\u3057\u307E\u3057\u305F\u3002
EnterScopeStackNotEmpty=\u30B3\u30FC\u30C9\u30BB\u30B0\u30E1\u30F3\u30C8\u306B\u5165\u308B\u524D\u306B\u3001\u30B9\u30BF\u30C3\u30AF\u30C8\u30C3\u30D7\u306B\u5024\u304C\u306A\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ExitScopeStackNotEmpty=\u30B3\u30FC\u30C9\u30BB\u30B0\u30E1\u30F3\u30C8\u3092\u96E2\u308C\u308B\u524D\u306B\u3001\u30B9\u30BF\u30C3\u30AF\u30C8\u30C3\u30D7\u306B\u5024\u304C\u306A\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ExpressionError=\u5F0F\u306E\u30A8\u30E9\u30FC\uFF1A%s\u3002
FailedIObtainContextSessionItem=\u30BB\u30C3\u30B7\u30E7\u30F3\u30A2\u30A4\u30C6\u30E0\u306E\u53D6\u5F97\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
FieldNotFound=\u6307\u5B9A\u3055\u308C\u305F\u30D5\u30A3\u30FC\u30EB\u30C9 s% \u306E\u5B9A\u7FA9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
FileNotFound=\u30D5\u30A1\u30A4\u30EB\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093 %s\u3002
JSONCodeBracketsError=s%\u3067\u59CB\u307E\u308A\u3001s%\u3067\u7D42\u308F\u3089\u306A\u3044\u3002
JSONGetCodeFailed=\u30B3\u30FC\u30C9\u306E\u53D6\u5F97\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u8A73\u7D30\u306F\u30ED\u30B0\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
LessThanOrEqualZero=%s \u306F0\u4EE5\u4E0B\u306B\u306A\u3063\u3066\u306F\u3044\u3051\u307E\u305B\u3093\u3002
LifeMethodError=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u306B\u95A2\u9023\u3059\u308B\u30E1\u30BD\u30C3\u30C9\u306F\u3001\u9759\u7684\u3067\u5F15\u6570\u306E\u306A\u3044\u3082\u306E\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093 %s %s\u3002
MaxSupportedBuffer=\u30D0\u30C3\u30D5\u30A1\u30FC\u3067\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u6700\u5927\u30B5\u30A4\u30BA\u3092\u8D85\u3048\u3066\u3044\u307E\u3059\u3002
MoreConsume=%s\u3092\u7E70\u308A\u8FD4\u3057\u6D88\u8CBB\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
NoTypeDefined=%s \u578B\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
NotFoundDTOSerializationMethod=%s \u306Edto\u30B7\u30EA\u30A2\u30E9\u30A4\u30BA\u65B9\u6CD5\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
NotFoundFactory=%s \u306E\u5B9F\u88C5\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
NotFoundMethod=\u578B%s\u306B\u30E1\u30BD\u30C3\u30C9%s\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
NotFoundParameterIndex=\u30BF\u30A4\u30D7 %s \u306B\u5BFE\u5FDC\u3059\u308B\u30D1\u30E9\u30E1\u30FC\u30BF\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
OnlySupportedTypes=%s \u578B\u306E\u307F\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u307E\u3059\u3002
OperationMismatch=\u30E6\u30FC\u30B6\u30FC %s \u306F\u578B %s \u306B\u5BFE\u3057\u3066\u9069\u7528\u3067\u304D\u307E\u305B\u3093\u3002
OutOfScope=\u5C40\u90E8\u5909\u6570\u304C\u30B9\u30B3\u30FC\u30D7\u5916\u306B\u306A\u308A\u307E\u3057\u305F\u3002
PoolDisposed=\u30D7\u30FC\u30EB\u306F\u89E3\u653E\u3055\u308C\u307E\u3057\u305F (s%)\u3002
PoolItemHaveBeenLent=\u6C60\u4E2D\u306E\u30A2\u30A4\u30C6\u30E0\u304C\u8CB8\u3057\u51FA\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u306E\u30A8\u30E9\u30FC\u306F\u3001\u30D7\u30FC\u30EB\u30D5\u30EC\u30FC\u30E0\u306B\u30D0\u30B0\u304C\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u3066\u3044\u307E\u3059\u3002\u3055\u3082\u306A\u3051\u308C\u3070\u3001\u3053\u306E\u30A8\u30E9\u30FC\u306F\u767A\u751F\u3057\u307E\u305B\u3093\u3002
PublishMessageFailed=\u30AD\u30E5\u30FC\u30E1\u30C3\u30BB\u30FC\u30B8 %s \u306E\u516C\u958B\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
RepeatBorrowingPoolItem=\u305D\u306E\u30A2\u30A4\u30C6\u30E0\u306F\u8CB8\u3057\u51FA\u3055\u308C\u3066\u304A\u308A\u3001\u518D\u3073\u8CB8\u3057\u51FA\u3059\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002\u3053\u308C\u306FPool\u30D5\u30EC\u30FC\u30E0\u30EF\u30FC\u30AF\u306B\u30D0\u30B0\u304C\u3042\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u306E\u3067\u3001\u7406\u7531\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044(s%)\u3002
RequestTimeout=RPC\u30EA\u30AF\u30A8\u30B9\u30C8 %s \u304C\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3057\u307E\u3057\u305F\u3002
ReturnError=\u30B9\u30BF\u30C3\u30AF\u306E\u5024\u304C1\u3092\u8D85\u3048\u308B\u3068\u3001\u4F8B\u5916\u304C\u8FD4\u3055\u308C\u307E\u3059\u3002
ReturnTypeMismatch=\u623B\u308A\u5024\u306E\u578B\u304C\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
ScopeDepthError=\u30B3\u30FC\u30C9\u30BB\u30B0\u30E1\u30F3\u30C8\u306E\u6DF1\u3055\u304C\u7570\u5E38\u3067\u3059\u3002
StackFramesCountError=\u8A08\u7B97\u30B9\u30BF\u30C3\u30AF\u306E\u4F8B\u5916\u3001\u30E1\u30BD\u30C3\u30C9\u3092\u7D42\u4E86\u3059\u308B\u3068\u304D\u306B\u307E\u3060\u30B9\u30BF\u30C3\u30AF\u30D5\u30EC\u30FC\u30E0\u304C\u5B58\u5728\u3057\u3066\u3044\u307E\u3059\u3002
StackItemCountError=\u30B9\u30BF\u30C3\u30AF\u30C8\u30C3\u30D7\u306E\u5909\u6570\u306E\u6570 %s \u306F\u671F\u5F85\u5024 %s \u3068\u7B49\u3057\u304F\u3042\u308A\u307E\u305B\u3093\u3002
StackItemLeastError=\u30B9\u30BF\u30C3\u30AF\u30C8\u30C3\u30D7\u306E\u5909\u6570\u306E\u6570 %s \u306F\u671F\u5F85\u5024 %s \u3088\u308A\u5C11\u306A\u3044\u3067\u3059\u3002
StackNotEmpty=\u30B9\u30BF\u30C3\u30AF\u306F\u7A7A\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
TimerWorking=\u30BF\u30A4\u30DE\u30FC\u304C\u52D5\u4F5C\u4E2D\u3067\u3059\u3002
TransformExpressionError=\u5909\u63DB\u5F0F\u30A8\u30E9\u30FC\u3002
TypeMismatch=\u578B\u304C\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
TypeMismatchFor=%s \u306E\u30BF\u30A4\u30D7\u304C\u671F\u5F85\u3055\u308C\u308B\u30BF\u30A4\u30D7 %s \u3068\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
TypeUnsafeConcurrentAccess=\u30BF\u30A4\u30D7 %s \u306F\u30B9\u30EC\u30C3\u30C9\u30BB\u30FC\u30D5\u3067\u306F\u306A\u3044\u304B\u3001SafeAccess\u30A2\u30CE\u30C6\u30FC\u30B7\u30E7\u30F3\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
UnableObtainGenericParameter=\u30B8\u30A7\u30CD\u30EA\u30C3\u30AF\u30D1\u30E9\u30E1\u30FC\u30BF\u306E\u5B9F\u969B\u306E\u578B\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3002
UnknownException=\u672A\u77E5\u306E\u4F8B\u5916\u3002
UseNewArrayMethod=\u69CB\u7BC9\u3055\u308C\u308B\u578B\u306F\u914D\u5217\u3067\u3059\u3002newArray\u30E1\u30BD\u30C3\u30C9\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
VariableNotFound=\u5909\u6570 's%' \u306E\u5B9A\u7FA9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
DTONotSupportedKeyValue=\u30AD\u30FC\u3068\u5024\u306E\u30DA\u30A2\u306EDTO\u30B7\u30EA\u30A2\u30EB\u5316\u64CD\u4F5C\u306F\u73FE\u5728\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093
